public class modulusAnimation {
    public static void main(String[] args) throws Exception{

        for ( int i=0; i<80; i++ )
        {
            if (i % 8 == 0)
                System.out.print("  ¸,ø¤º°`°º¤ø,¸٩(̾●̮̮̃̾•̃̾)۶¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸¸,ø¤º°`°º¤ø,¸ \r");
            else if (i % 8 == 1)
                System.out.print("  °º¤ø,..,ø¤º°`°º¤ø,¸٩(̾●̮̮̃̾•̃̾)۶¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸¸,ø¤º°` \r");
            else if (i % 8 == 2)
                System.out.print("  ¸,ø¤º°`°º¤ø,..,ø¤º°`°º¤ø,¸٩(̾●̮̮̃̾•̃̾)۶¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸ \r");
            else if (i % 8 == 3)
                System.out.print("  °º¤ø,..,ø¤º°`°º¤ø,¸¸,ø¤º°`°º¤ø,¸٩(̾●̮̮̃̾•̃̾)۶¸,ø¤°`º¤ø,¸¸,ø¤º°` \r");
            else if (i % 8 == 4)
                System.out.print("  ¸,ø¤º°`°º¤ø,¸¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸٩(̾●̮̮̃̾•̃̾)۶¸,ø¤º°`°º¤ø,¸ \r");
            else if (i % 8 == 5)
                System.out.print("  °º¤ø,..,ø¤º°`°º¤ø,¸¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸٩(̾●̮̮̃̾•̃̾)۶¸,ø¤º°` \r");
            else if (i % 8 == 6)
                System.out.print("  ●̮̮̃̾•̃̾)۶¸,ø¤º°`°º¤ø,¸¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸¸,ø¤º°`°º¤ø,¸٩(̾  \r");
            else if (i % 8 == 7)
                System.out.print("  °º¤ø,.٩(̾●̮̮̃̾•̃̾)۶.,ø¤º°`°º¤ø,¸¸,ø¤º°`°º¤ø,¸¸,ø¤°`º¤ø,¸¸,ø¤º°` \r");



            Thread.sleep(200);
        }


    }
}
